## 数据抽取
loc-以列名或行名作为参数，当只有一个参数时默认是**行名**，即抽取整行数据，包括所有的列。(行名是index)

iloc-以行和列**位置索引**作为参数，0表示第1行，1表示第2行，只有一个参数时默认是行索引。(行号和列号）

In [1]:
import pandas as pd
df=pd.DataFrame([[1,2,3],[3,3,3]])

In [25]:
df[0]#选择列

0    1
1    3
Name: 0, dtype: int64

In [26]:
df.iloc[1]#选择行

0    3
1    3
2    3
Name: 1, dtype: int64

In [29]:
df.loc[1]

0    3
1    3
2    3
Name: 1, dtype: int64

In [28]:
df

   0  1  2
0  1  2  3
1  3  3  3

In [30]:
df.set_index(0)

   1  2
0
1  2  3
3  3  3

In [31]:
df[1]

0    2
1    3
Name: 1, dtype: int64

In [37]:
df1=df.set_index(0)
df1

   1  2
0
1  2  3
3  3  3

In [46]:
df1.loc[3]

1    3
2    3
Name: 3, dtype: int64

## 提取区域数据

In [51]:
df1.loc[1,2]

3

In [52]:
df1.loc[3,1]

3

In [55]:
df

   0  1  2
0  1  2  3
1  3  3  3

In [60]:
df.loc[[0,1],[1,2]]#提取一部分

   1  2
0  2  3
1  3  3